/*2151974 软件 赵明泽*/
#include <iostream>
#include <iomanip>
#include <cstdio>
using namespace std;

/* -----------------------------------------------------------------------------------
		允许   ：1、按需增加一个或多个函数，但是所有增加的函数中不允许任何形式的循环
				 2、定义符号常量
				 3、定义const型变量

		不允许 ：1、定义全局变量和静态局部变量
   ----------------------------------------------------------------------------------- */

   /***************************************************************************
		函数名称：cnt
		功    能：打印最大宽度=
		输入参数：char a
		返 回 值：char
		说    明：形参按需设置
	  ***************************************************************************/
char cnt(char a)
{
	if (a == 'A')
	{
		return '=';
	}
	cout << "==";
	return cnt(a - 1);
}

/***************************************************************************
		函数名称：num
		功    能：返回层数
		输入参数：char a
		返 回 值：int
		说    明：形参按需设置
	  ***************************************************************************/
int num(char a)
{
	return (int)(a) - 64;
}

/***************************************************************************
		函数名称：cout_space1
		功    能：输出空格
		输入参数：int t, int tt
		返 回 值：void
		说    明：形参按需设置
	  ***************************************************************************/
void cout_space1(int t, int tt)
{
	if (t - tt == 0)
	{
		return;
	}
	else
	{
		cout << " ";
		cout_space1(t - 1, tt);
	}
}

/***************************************************************************
		函数名称：cout_space2
		功    能：输出空格
		输入参数：int t, int tt
		返 回 值：void
		说    明：形参按需设置
	  ***************************************************************************/
void cout_space2(int t, int tt)
{
	if (t - 1 == tt)
	{
		return;
	}
	else
	{
		cout_space2(t, tt + 1);
		cout << " ";
		
	}
}

/***************************************************************************
		函数名称：abc1
		功    能：输出每一行的内容（前面）
		输入参数：char a
		返 回 值：void
		说    明：形参按需设置
	  ***************************************************************************/
void abc1(char a)
{
	if (a == 'A')
	{
		return;
	}
	else
	{
		cout << a;
		abc1(a - 1);
	}
}

/***************************************************************************
		函数名称：abc2
		功    能：输出每一行的内容（后面）
		输入参数：char a, char b
		返 回 值：void
		说    明：形参按需设置
	  ***************************************************************************/
void abc2(char a, char b)
{
	if (a == b)
	{
		return;
	}
	else
	{
		cout << char(a + 1);
		abc2(a + 1, b);
	}
}

/***************************************************************************
		函数名称：abc3
		功    能：输出每一行的内容（前面）
		输入参数：char a, cahr b
		返 回 值：void
		说    明：形参按需设置
	  ***************************************************************************/
void abc3(char a, char b)
{
	if (b == a)
	{
		return;
	}
	else
	{
		cout << char(b + 1);
		abc3(a, b + 1);
	}
}

/***************************************************************************
		函数名称：abc4
		功    能：输出每一行的内容（后面）
		输入参数：char a, char b
		返 回 值：void
		说    明：形参按需设置
	  ***************************************************************************/
void abc4(char a, char b)
{
	if (a + 1 == b)
	{
		return;
	}
	else
	{
		abc4(a + 1, b);
		cout << char(a);
	}
}

   /***************************************************************************
	 函数名称：print_tower
	 功    能：打印字母塔
	 输入参数：char a,int b
	 返 回 值：void
	 说    明：形参按需设置
   ***************************************************************************/
void print_tower(char a, int t, int tt, int judge)
{
	/* 按需实现，函数中不允许任何形式的循环*/
	
	cout << setiosflags(ios::right);
	
	if (judge)
	{
		if (t == 0)
		{
			return;
		}
		else
		{
			print_tower(a - 1, t - 1, tt, 1);
			cout_space1(tt, t);
			abc1(a);
			cout << 'A';
			abc2('A', a);
			cout << endl;
		}
	}
	else
	{
		if (t == tt)
		{
			return;
		}
		else
		{
			print_tower(a - 1, t + 1, tt, 0);
			cout_space2(tt, t);
			abc3('A' + tt - 1, a - 1);
			abc4(a, 'A' + tt);
			cout << endl;
		}
	}
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数中的...允许修改，其余位置不准修改
***************************************************************************/
int main()
{
	char end_ch;

	/* 键盘输入结束字符(仅大写有效) */
	cout << "请输入结束字符(A~Z)" << endl;
	end_ch = getchar();			//读缓冲区第一个字符
	if (end_ch < 'A' || end_ch > 'Z') {
		cout << "结束字符不是大写字母" << endl;
		return -1;
	}

	/* 正三角字母塔(中间为A) */
	cout << cnt(end_ch) << endl; /* 按字母塔最大宽度输出=(不允许用循环) */
	cout << "正三角字母塔" << endl;
	cout << cnt(end_ch) << endl; /* 按字母塔最大宽度输出=(不允许用循环) */
	print_tower(end_ch, num(end_ch), num(end_ch), 1);
	cout << endl;

	/* 倒三角字母塔(两边为A) */
	cout << cnt(end_ch) << endl; /* 按字母塔最大宽度输出=(不允许用循环) */
	cout << "倒三角字母塔" << endl;
	cout << cnt(end_ch) << endl; /* 按字母塔最大宽度输出=(不允许用循环) */
	print_tower(end_ch, 0, num(end_ch), 0);
	cout << endl;

	return 0;
}